{
  "_name_or_path": "./ancient-greek-bert-local",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Anger",
    "1": "Anticipation",
    "2": "Disgust",
    "3": "Fear",
    "4": "Joy",
    "5": "Sadness",
    "6": "Surprise",
    "7": "Trust"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Anger": 0,
    "Anticipation": 1,
    "Disgust": 2,
    "Fear": 3,
    "Joy": 4,
    "Sadness": 5,
    "Surprise": 6,
    "Trust": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_max_length": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
